#+title: Template
#+property: header-args:jupyter-python :kernel my-tmdb :session testo

* Init
#+begin_src jupyter-python :async yes
import logging, sys, time
from IPython import get_ipython

# Display stderr messages in output
sys.stderr = sys.stdout
# Setup root logger format
logging.basicConfig(
    level=logging.INFO,  # default is WARNING
    format="%(asctime)s-%(module)s[%(funcName)s:%(lineno)s]\n"
    "%(levelname)s-%(message)s",
)
# Enable auto-reload of imported code
ipy = get_ipython()
if "IPython.extensions.autoreload" not in sys.modules:
    ipy.run_line_magic("load_ext", "autoreload")
# Set external code to reload before each exec
ipy.run_line_magic("autoreload", "2")


def runf(func):
    t0 = time.time()
    r = func()
    print(f"Task finished in {time.time()-t0:.2f}s")
    return r


print("Init done")
#+end_src
* Movies
** Movie
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager
    from tmdb.movie import TmdbMovie

    tm = TmdbManager()
    mid = 829280
    movie = TmdbMovie.from_tmdb(mid=mid, tm=tm)
    pprint.pprint(movie.data)


runf(func)  # pylint: disable=undefined-variable
#+end_src

#+RESULTS:
: {'credits': {'cast': [{'adult': False,
:                        'cast_id': 1,
:                        'character': 'Enola Holmes',
:                        'credit_id': '609d4e415b1240002a41aba8',
:                        'gender': 1,
:                        'id': 1356210,
:                        'known_for_department': 'Acting',
:                        'name': 'Millie Bobby Brown',
:                        'order': 0,
:                        'original_name': 'Millie Bobby Brown',
:                        'popularity': 107.272,
:                        'profile_path': '/2685xGmq68G6tmnUbfgSR6rywEV.jpg'},
:                       {'adult': False,
:                        'cast_id': 2,
:                        'character': 'Sherlock Holmes',
:                        'credit_id': '609d4e4e848eb90029de5081',
:                        'gender': 2,
:                        'id': 73968,
:                        'known_for_department': 'Acting',
:                        'name': 'Henry Cavill',
:                        'order': 1,
:                        'original_name': 'Henry Cavill',
:                        'popularity': 51.772,
:                        'profile_path': '/iWdKjMry5Pt7vmxU7bmOQsIUyHa.jpg'},
:                       {'adult': False,
:                        'cast_id': 6,
:                        'character': 'Lord Tewkesbury',
:                        'credit_id': '60dc2f66b686b9002d5a0009',
:                        'gender': 2,
:                        'id': 1558986,
:                        'known_for_department': 'Acting',
:                        'name': 'Louis Partridge',
:                        'order': 2,
:                        'original_name': 'Louis Partridge',
:                        'popularity': 29.431,
:                        'profile_path': '/wuZNRskGHWWLo3uS22VcgKcJgZB.jpg'},
:                       {'adult': False,
:                        'cast_id': 7,
:                        'character': 'Eudoria Holmes',
:                        'credit_id': '615382c9d6590b002558ca28',
:                        'gender': 1,
:                        'id': 1283,
:                        'known_for_department': 'Acting',
:                        'name': 'Helena Bonham Carter',
:                        'order': 3,
:                        'original_name': 'Helena Bonham Carter',
:                        'popularity': 46.012,
:                        'profile_path': '/DDeITcCpnBd0CkAIRPhggy9bt5.jpg'},
:                       {'adult': False,
:                        'cast_id': 16,
:                        'character': 'Grail',
:                        'credit_id': '6153845643d9b10062330a95',
:                        'gender': 2,
:                        'id': 11207,
:                        'known_for_department': 'Acting',
:                        'name': 'David Thewlis',
:                        'order': 4,
:                        'original_name': 'David Thewlis',
:                        'popularity': 33.315,
:                        'profile_path': '/sNuYyT8ocLlQr3TdAW9CoKVbCU8.jpg'},
:                       {'adult': False,
:                        'cast_id': 17,
:                        'character': 'Edith',
:                        'credit_id': '6153845ffab3fa00639a0343',
:                        'gender': 1,
:                        'id': 1531926,
:                        'known_for_department': 'Acting',
:                        'name': 'Susan Wokoma',
:                        'order': 5,
:                        'original_name': 'Susan Wokoma',
:                        'popularity': 7.375,
:                        'profile_path': '/uzcYkQ1KWlNEOrwnklGH8C3qB1Y.jpg'},
:                       {'adult': False,
:                        'cast_id': 18,
:                        'character': 'Lestrade',
:                        'credit_id': '61538468158c85002c52b90e',
:                        'gender': 2,
:                        'id': 81840,
:                        'known_for_department': 'Acting',
:                        'name': 'Adeel Akhtar',
:                        'order': 6,
:                        'original_name': 'Adeel Akhtar',
:                        'popularity': 9.322,
:                        'profile_path': '/nNdjhe4t5CSqcFGCa7ERe40OW2o.jpg'},
:                       {'adult': False,
:                        'cast_id': 19,
:                        'character': 'Mira Troy',
:                        'credit_id': '61538471fab3fa008db54d16',
:                        'gender': 1,
:                        'id': 195666,
:                        'known_for_department': 'Acting',
:                        'name': 'Sharon Duncan-Brewster',
:                        'order': 7,
:                        'original_name': 'Sharon Duncan-Brewster',
:                        'popularity': 6.053,
:                        'profile_path': '/av9gsJMlTnkzcRPyURBxAvlq9YX.jpg'},
:                       {'adult': False,
:                        'cast_id': 20,
:                        'character': 'Cicely',
:                        'credit_id': '6153847bfe6c180026ca117c',
:                        'gender': 1,
:                        'id': 2301682,
:                        'known_for_department': 'Acting',
:                        'name': 'Hannah Dodd',
:                        'order': 8,
:                        'original_name': 'Hannah Dodd',
:                        'popularity': 10.664,
:                        'profile_path': '/55KfjaxQJClbl6pEcPMKHDle4Jj.jpg'},
:                       {'adult': False,
:                        'cast_id': 21,
:                        'character': 'Mae',
:                        'credit_id': '61538484e329430061edd82c',
:                        'gender': 1,
:                        'id': 2692493,
:                        'known_for_department': 'Acting',
:                        'name': 'Abbie Hern',
:                        'order': 9,
:                        'original_name': 'Abbie Hern',
:                        'popularity': 8.601,
:                        'profile_path': '/duZ7DxzjMxOeFPB7VyIFuHtczAM.jpg'},
:                       {'adult': False,
:                        'cast_id': 22,
:                        'character': 'William Lyon',
:                        'credit_id': '615384949974ee0043f07546',
:                        'gender': 2,
:                        'id': 3251451,
:                        'known_for_department': 'Acting',
:                        'name': 'Gabriel Tierney',
:                        'order': 10,
:                        'original_name': 'Gabriel Tierney',
:                        'popularity': 0.6,
:                        'profile_path': '/gvsGc8NAEVd3FgJDeYlYKITMGpJ.jpg'},
:                       {'adult': False,
:                        'cast_id': 23,
:                        'character': 'Bessie Chapman',
:                        'credit_id': '6153849dd1ca2a00906b289f',
:                        'gender': 1,
:                        'id': 3251452,
:                        'known_for_department': 'Acting',
:                        'name': 'Serrana Su-Ling Bliss',
:                        'order': 11,
:                        'original_name': 'Serrana Su-Ling Bliss',
:                        'popularity': 1.38,
:                        'profile_path': '/h3FCGvanMlV6FQjE3p3TQ5llcNU.jpg'},
:                       {'adult': False,
:                        'cast_id': 25,
:                        'character': 'Hilda Lyons',
:                        'credit_id': '6353056756b9f7007b1347a9',
:                        'gender': 0,
:                        'id': 3542156,
:                        'known_for_department': 'Acting',
:                        'name': 'Róisín Monaghan',
:                        'order': 12,
:                        'original_name': 'Róisín Monaghan',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'cast_id': 28,
:                        'character': 'Henry Lyon',
:                        'credit_id': '635305c59590e3007afb6e9e',
:                        'gender': 2,
:                        'id': 85629,
:                        'known_for_department': 'Acting',
:                        'name': 'David Westhead',
:                        'order': 13,
:                        'original_name': 'David Westhead',
:                        'popularity': 3.969,
:                        'profile_path': '/rgTIZ5Gxnfs4oEPwlvcejUEIFw6.jpg'},
:                       {'adult': False,
:                        'cast_id': 109,
:                        'character': 'Young Enola',
:                        'credit_id': '636503ef9020120079485ff4',
:                        'gender': 1,
:                        'id': 2846031,
:                        'known_for_department': 'Acting',
:                        'name': 'Sofia Stavrinou',
:                        'order': 14,
:                        'original_name': 'Sofia Stavrinou',
:                        'popularity': 1.565,
:                        'profile_path': None},
:                       {'adult': False,
:                        'cast_id': 110,
:                        'character': 'Dr. Watson',
:                        'credit_id': '636504205437f500823b8a04',
:                        'gender': 2,
:                        'id': 1227717,
:                        'known_for_department': 'Acting',
:                        'name': 'Himesh Patel',
:                        'order': 15,
:                        'original_name': 'Himesh Patel',
:                        'popularity': 11.484,
:                        'profile_path': '/fC6diZ0i3Epot9dRl7b2SSegf4L.jpg'},
:                       {'adult': False,
:                        'cast_id': 111,
:                        'character': 'Agatha Gowerdale',
:                        'credit_id': '63650457d7107e008d773b25',
:                        'gender': 0,
:                        'id': 3571286,
:                        'known_for_department': 'Acting',
:                        'name': 'Catriona Chandler',
:                        'order': 16,
:                        'original_name': 'Catriona Chandler',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'cast_id': 112,
:                        'character': 'Mr. Bill Crouch',
:                        'credit_id': '6367b749350398007d21a052',
:                        'gender': 2,
:                        'id': 138161,
:                        'known_for_department': 'Acting',
:                        'name': 'Lee Boardman',
:                        'order': 17,
:                        'original_name': 'Lee Boardman',
:                        'popularity': 2.301,
:                        'profile_path': '/ghJ28dk1Zrl5C3KiC62nskgsqUi.jpg'},
:                       {'adult': False,
:                        'cast_id': 113,
:                        'character': 'Charles McIntyre',
:                        'credit_id': '636802d396e30b00827a88c1',
:                        'gender': 2,
:                        'id': 15740,
:                        'known_for_department': 'Acting',
:                        'name': 'Tim McMullan',
:                        'order': 18,
:                        'original_name': 'Tim McMullan',
:                        'popularity': 14.774,
:                        'profile_path': '/7RaL5N5riQlgdjEvgK4hWJie4mc.jpg'},
:                       {'adult': False,
:                        'cast_id': 114,
:                        'character': 'Sgt. Beeston',
:                        'credit_id': '636803394ca676007ea067f1',
:                        'gender': 2,
:                        'id': 1441565,
:                        'known_for_department': 'Crew',
:                        'name': 'Tony Lucken',
:                        'order': 19,
:                        'original_name': 'Tony Lucken',
:                        'popularity': 2.043,
:                        'profile_path': None}],
:              'crew': [{'adult': False,
:                        'credit_id': '6353081bf3b49a007dd36bb2',
:                        'department': 'Camera',
:                        'gender': 2,
:                        'id': 3079,
:                        'job': 'Director of Photography',
:                        'known_for_department': 'Camera',
:                        'name': 'Giles Nuttgens',
:                        'original_name': 'Giles Nuttgens',
:                        'popularity': 1.423,
:                        'profile_path': '/jz40SpwgZtAshuVWq2ThsGpxObs.jpg'},
:                       {'adult': False,
:                        'credit_id': '635308a6f8e982007c5c87cd',
:                        'department': 'Costume & Make-Up',
:                        'gender': 1,
:                        'id': 15734,
:                        'job': 'Costume Design',
:                        'known_for_department': 'Costume & Make-Up',
:                        'name': 'Consolata Boyle',
:                        'original_name': 'Consolata Boyle',
:                        'popularity': 2.588,
:                        'profile_path': '/6UwAvvXKsMmvicMnc3n5w4zMjSF.jpg'},
:                       {'adult': False,
:                        'credit_id': '6353083a417aaf007a8942c6',
:                        'department': 'Art',
:                        'gender': 2,
:                        'id': 16364,
:                        'job': 'Production Design',
:                        'known_for_department': 'Art',
:                        'name': 'Michael Carlin',
:                        'original_name': 'Michael Carlin',
:                        'popularity': 0.952,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530dd1d8e225008223ad5f',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 24232,
:                        'job': 'Second Unit Director of Photography',
:                        'known_for_department': 'Camera',
:                        'name': 'Hamish Doyne-Ditmas',
:                        'original_name': 'Hamish Doyne-Ditmas',
:                        'popularity': 1.4,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c6056b9f70099360330',
:                        'department': 'Sound',
:                        'gender': 2,
:                        'id': 52452,
:                        'job': 'Music Supervisor',
:                        'known_for_department': 'Sound',
:                        'name': 'Peter Afterman',
:                        'original_name': 'Peter Afterman',
:                        'popularity': 1.686,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530de3a0f1a2007cddf026',
:                        'department': 'Camera',
:                        'gender': 2,
:                        'id': 34194,
:                        'job': 'Camera Operator',
:                        'known_for_department': 'Camera',
:                        'name': 'Paul Edwards',
:                        'original_name': 'Paul Edwards',
:                        'popularity': 1.28,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530dee15c636007dca44c6',
:                        'department': 'Camera',
:                        'gender': 2,
:                        'id': 34194,
:                        'job': 'Steadicam Operator',
:                        'known_for_department': 'Camera',
:                        'name': 'Paul Edwards',
:                        'original_name': 'Paul Edwards',
:                        'popularity': 1.28,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '615383dadd731b0042a47db4',
:                        'department': 'Production',
:                        'gender': 2,
:                        'id': 90281,
:                        'job': 'Producer',
:                        'known_for_department': 'Production',
:                        'name': 'Alex Garcia',
:                        'original_name': 'Alex Garcia',
:                        'popularity': 2.939,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '615383cbe8a3e1004301bbad',
:                        'department': 'Production',
:                        'gender': 1,
:                        'id': 114408,
:                        'job': 'Producer',
:                        'known_for_department': 'Production',
:                        'name': 'Mary Parent',
:                        'original_name': 'Mary Parent',
:                        'popularity': 3.665,
:                        'profile_path': '/816gbyiVTV0iarFv5ZLkwZMvZsp.jpg'},
:                       {'adult': False,
:                        'credit_id': '609d4e628dbc330040841873',
:                        'department': 'Directing',
:                        'gender': 2,
:                        'id': 173847,
:                        'job': 'Director',
:                        'known_for_department': 'Directing',
:                        'name': 'Harry Bradbeer',
:                        'original_name': 'Harry Bradbeer',
:                        'popularity': 9.648,
:                        'profile_path': '/1fGaCCtKp3ZCXCkWRzOn4l7YnBE.jpg'},
:                       {'adult': False,
:                        'credit_id': '615383bafab3fa008db54bec',
:                        'department': 'Production',
:                        'gender': 2,
:                        'id': 173847,
:                        'job': 'Executive Producer',
:                        'known_for_department': 'Directing',
:                        'name': 'Harry Bradbeer',
:                        'original_name': 'Harry Bradbeer',
:                        'popularity': 9.648,
:                        'profile_path': '/1fGaCCtKp3ZCXCkWRzOn4l7YnBE.jpg'},
:                       {'adult': False,
:                        'credit_id': '6153841ed6590b008c6c5b4b',
:                        'department': 'Production',
:                        'gender': 2,
:                        'id': 207132,
:                        'job': 'Executive Producer',
:                        'known_for_department': 'Writing',
:                        'name': 'Jack Thorne',
:                        'original_name': 'Jack Thorne',
:                        'popularity': 3.07,
:                        'profile_path': '/siVfYSurwcIrplOc0vP3DiJAVN2.jpg'},
:                       {'adult': False,
:                        'credit_id': '609d4e7242022800791c3e4e',
:                        'department': 'Writing',
:                        'gender': 2,
:                        'id': 207132,
:                        'job': 'Writer',
:                        'known_for_department': 'Writing',
:                        'name': 'Jack Thorne',
:                        'original_name': 'Jack Thorne',
:                        'popularity': 3.07,
:                        'profile_path': '/siVfYSurwcIrplOc0vP3DiJAVN2.jpg'},
:                       {'adult': False,
:                        'credit_id': '6353080cca835400992e723d',
:                        'department': 'Sound',
:                        'gender': 2,
:                        'id': 582922,
:                        'job': 'Music',
:                        'known_for_department': 'Sound',
:                        'name': 'Daniel Pemberton',
:                        'original_name': 'Daniel Pemberton',
:                        'popularity': 6.602,
:                        'profile_path': '/wRQfyEeL0oa3mvR4Hkm6sZ2R1Jc.jpg'},
:                       {'adult': False,
:                        'credit_id': '6353086c84448e007a5d3e28',
:                        'department': 'Art',
:                        'gender': 2,
:                        'id': 1050634,
:                        'job': 'Supervising Art Director',
:                        'known_for_department': 'Art',
:                        'name': 'James Lewis',
:                        'original_name': 'James Lewis',
:                        'popularity': 1.286,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '635308269590e3007fa59824',
:                        'department': 'Production',
:                        'gender': 1,
:                        'id': 1157619,
:                        'job': 'Casting',
:                        'known_for_department': 'Production',
:                        'name': 'Orla Maxwell',
:                        'original_name': 'Orla Maxwell',
:                        'popularity': 1.4,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530d5615c636007dca44ab',
:                        'department': 'Camera',
:                        'gender': 2,
:                        'id': 1181554,
:                        'job': 'Still Photographer',
:                        'known_for_department': 'Camera',
:                        'name': 'Alex Bailey',
:                        'original_name': 'Alex Bailey',
:                        'popularity': 1.176,
:                        'profile_path': '/pCCD8KSSYHYXMEsLJAAHeO2eNwp.jpg'},
:                       {'adult': False,
:                        'credit_id': '63530ce8c99826008297eb56',
:                        'department': 'Directing',
:                        'gender': 1,
:                        'id': 1234354,
:                        'job': 'Script Supervisor',
:                        'known_for_department': 'Acting',
:                        'name': 'Sarah Hayward',
:                        'original_name': 'Sarah Hayward',
:                        'popularity': 3.189,
:                        'profile_path': '/qJUXnOYb9pAyjf8h0Jjp4gbY2w9.jpg'},
:                       {'adult': False,
:                        'credit_id': '6153843b9f5dfb008a7e9541',
:                        'department': 'Production',
:                        'gender': 1,
:                        'id': 1356210,
:                        'job': 'Producer',
:                        'known_for_department': 'Acting',
:                        'name': 'Millie Bobby Brown',
:                        'original_name': 'Millie Bobby Brown',
:                        'popularity': 107.272,
:                        'profile_path': '/2685xGmq68G6tmnUbfgSR6rywEV.jpg'},
:                       {'adult': False,
:                        'credit_id': '6353084b56b9f70099360293',
:                        'department': 'Art',
:                        'gender': 0,
:                        'id': 1373700,
:                        'job': 'Art Direction',
:                        'known_for_department': 'Art',
:                        'name': 'Will Coubrough',
:                        'original_name': 'Will Coubrough',
:                        'popularity': 1.286,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530efaa0f1a20090b0e69f',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 1404244,
:                        'job': 'Aerial Director of Photography',
:                        'known_for_department': 'Camera',
:                        'name': 'John Marzano',
:                        'original_name': 'John Marzano',
:                        'popularity': 1.176,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530a69a843c1007aa019ea',
:                        'department': 'Production',
:                        'gender': 1,
:                        'id': 1408366,
:                        'job': 'Production Manager',
:                        'known_for_department': 'Production',
:                        'name': 'Ali James',
:                        'original_name': 'Ali James',
:                        'popularity': 0.6,
:                        'profile_path': '/dg4kkto55FUBC7GZy2gr5tNj57X.jpg'},
:                       {'adult': False,
:                        'credit_id': '635309a8d8e225007a1a183a',
:                        'department': 'Costume & Make-Up',
:                        'gender': 0,
:                        'id': 1429628,
:                        'job': 'Hairstylist',
:                        'known_for_department': 'Costume & Make-Up',
:                        'name': 'Anita Burger',
:                        'original_name': 'Anita Burger',
:                        'popularity': 1.52,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530ca4ca835400992e7300',
:                        'department': 'Sound',
:                        'gender': 1,
:                        'id': 1537698,
:                        'job': 'Music Supervisor',
:                        'known_for_department': 'Sound',
:                        'name': 'Alison Litton',
:                        'original_name': 'Alison Litton',
:                        'popularity': 0.832,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c7f244182007f23929a',
:                        'department': 'Sound',
:                        'gender': 2,
:                        'id': 1545164,
:                        'job': 'Orchestrator',
:                        'known_for_department': 'Sound',
:                        'name': 'Mark Baechle',
:                        'original_name': 'Mark Baechle',
:                        'popularity': 1.176,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530e97d8e225008223ad7b',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 1621405,
:                        'job': 'First Assistant "B" Camera',
:                        'known_for_department': 'Camera',
:                        'name': 'Gabriel Hyman',
:                        'original_name': 'Gabriel Hyman',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530a4b5f4b73008d567168',
:                        'department': 'Production',
:                        'gender': 2,
:                        'id': 1637825,
:                        'job': 'Unit Production Manager',
:                        'known_for_department': 'Production',
:                        'name': 'James Grant',
:                        'original_name': 'James Grant',
:                        'popularity': 1.159,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530cfd15c636007a99dfe4',
:                        'department': 'Directing',
:                        'gender': 0,
:                        'id': 1735126,
:                        'job': 'Script Supervisor',
:                        'known_for_department': 'Directing',
:                        'name': 'Jane Houston',
:                        'original_name': 'Jane Houston',
:                        'popularity': 1.128,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530d909369a200812a146f',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 1740777,
:                        'job': 'First Assistant Camera',
:                        'known_for_department': 'Camera',
:                        'name': 'Anna Benbow',
:                        'original_name': 'Anna Benbow',
:                        'popularity': 0.728,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '615383ecaf58cb002af87f9d',
:                        'department': 'Production',
:                        'gender': 1,
:                        'id': 1778183,
:                        'job': 'Producer',
:                        'known_for_department': 'Production',
:                        'name': 'Ali Mendes',
:                        'original_name': 'Ali Mendes',
:                        'popularity': 4.329,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530e6eca835400992e7346',
:                        'department': 'Camera',
:                        'gender': 2,
:                        'id': 1780491,
:                        'job': 'Focus Puller',
:                        'known_for_department': 'Camera',
:                        'name': 'James Harrison',
:                        'original_name': 'James Harrison',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530cb7ca835400992e7305',
:                        'department': 'Sound',
:                        'gender': 0,
:                        'id': 1815726,
:                        'job': 'Music Editor',
:                        'known_for_department': 'Sound',
:                        'name': 'Ben Smithers',
:                        'original_name': 'Ben Smithers',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530d4856b9f7009936035d',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 1819553,
:                        'job': 'Drone Pilot',
:                        'known_for_department': 'Crew',
:                        'name': 'Peter Ayriss',
:                        'original_name': 'Peter Ayriss',
:                        'popularity': 1.159,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530b0da0f1a2007cddefab',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 1821918,
:                        'job': 'Casting Associate',
:                        'known_for_department': 'Production',
:                        'name': 'Andreya Lynham',
:                        'original_name': 'Andreya Lynham',
:                        'popularity': 1.4,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '6353085b56b9f70099360298',
:                        'department': 'Art',
:                        'gender': 0,
:                        'id': 1956198,
:                        'job': 'Art Direction',
:                        'known_for_department': 'Art',
:                        'name': 'Kate Suzanne Hunter',
:                        'original_name': 'Kate Suzanne Hunter',
:                        'popularity': 1.56,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530eddf8e98200799a58ac',
:                        'department': 'Lighting',
:                        'gender': 2,
:                        'id': 1969705,
:                        'job': 'Electrician',
:                        'known_for_department': 'Lighting',
:                        'name': 'Matt Markham',
:                        'original_name': 'Matt Markham',
:                        'popularity': 0.694,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530879417aaf008269f2e0',
:                        'department': 'Art',
:                        'gender': 0,
:                        'id': 2014406,
:                        'job': 'Art Direction',
:                        'known_for_department': 'Art',
:                        'name': 'Luke Whitelock',
:                        'original_name': 'Luke Whitelock',
:                        'popularity': 0.732,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '609d4e815b1240002a41abd9',
:                        'department': 'Writing',
:                        'gender': 0,
:                        'id': 2145002,
:                        'job': 'Novel',
:                        'known_for_department': 'Writing',
:                        'name': 'Nancy Springer',
:                        'original_name': 'Nancy Springer',
:                        'popularity': 1.712,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530aa2c99826007ddcc1f9',
:                        'department': 'Directing',
:                        'gender': 0,
:                        'id': 2216759,
:                        'job': 'Second Unit First Assistant Director',
:                        'known_for_department': 'Directing',
:                        'name': 'Scott Bunce',
:                        'original_name': 'Scott Bunce',
:                        'popularity': 0.732,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530abd84448e009154c17a',
:                        'department': 'Directing',
:                        'gender': 0,
:                        'id': 2313663,
:                        'job': 'First Assistant Director',
:                        'known_for_department': 'Directing',
:                        'name': 'Zoe Liang',
:                        'original_name': 'Zoe Liang',
:                        'popularity': 0.84,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '615383f9d6590b004286ac5c',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 2364439,
:                        'job': 'Executive Producer',
:                        'known_for_department': 'Production',
:                        'name': 'Joshua Grode',
:                        'original_name': 'Joshua Grode',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530d20a0f1a20079633f0c',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 2395365,
:                        'job': 'Production Assistant',
:                        'known_for_department': 'Production',
:                        'name': 'Arianne Tavares',
:                        'original_name': 'Arianne Tavares',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530dbc255dba007def4558',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 2423279,
:                        'job': 'Second Assistant Camera',
:                        'known_for_department': 'Camera',
:                        'name': 'Rich Daws',
:                        'original_name': 'Rich Daws',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '6353098cf8e982007c5c87f2',
:                        'department': 'Costume & Make-Up',
:                        'gender': 0,
:                        'id': 2424193,
:                        'job': 'Makeup Artist',
:                        'known_for_department': 'Costume & Make-Up',
:                        'name': 'Kat Ali',
:                        'original_name': 'Kat Ali',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '61538428af58cb00653a9084',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 2452961,
:                        'job': 'Producer',
:                        'known_for_department': 'Production',
:                        'name': 'Paige Brown',
:                        'original_name': 'Paige Brown',
:                        'popularity': 1.456,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530d3cc9dbf9007afede6a',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 2476623,
:                        'job': 'Aerial Director of Photography',
:                        'known_for_department': 'Camera',
:                        'name': 'Phil Arntz',
:                        'original_name': 'Phil Arntz',
:                        'popularity': 0.829,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530e1e9369a200812a148d',
:                        'department': 'Lighting',
:                        'gender': 0,
:                        'id': 2476641,
:                        'job': 'Gaffer',
:                        'known_for_department': 'Lighting',
:                        'name': 'Michael Fennelly',
:                        'original_name': 'Michael Fennelly',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530e30a843c10091b28833',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 2611269,
:                        'job': 'Drone Pilot',
:                        'known_for_department': 'Camera',
:                        'name': 'Mike Foyle',
:                        'original_name': 'Mike Foyle',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530bec244182007ab62bb4',
:                        'department': 'Production',
:                        'gender': 2,
:                        'id': 2836349,
:                        'job': 'Assistant Location Manager',
:                        'known_for_department': 'Production',
:                        'name': 'Jack Leary',
:                        'original_name': 'Jack Leary',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c91c9dbf9007afede54',
:                        'department': 'Sound',
:                        'gender': 1,
:                        'id': 2847225,
:                        'job': 'Music Coordinator',
:                        'known_for_department': 'Sound',
:                        'name': 'Jane Berry',
:                        'original_name': 'Jane Berry',
:                        'popularity': 1.052,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530da084448e007f77ef6a',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 2944172,
:                        'job': 'Camera Trainee',
:                        'known_for_department': 'Camera',
:                        'name': 'Lucy Bradley',
:                        'original_name': 'Lucy Bradley',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530d6d9590e3007fa598ff',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 3023210,
:                        'job': 'Second Assistant Camera',
:                        'known_for_department': 'Camera',
:                        'name': 'Thomas Barber',
:                        'original_name': 'Thomas Barber',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '635309fef3b49a007a8440e5',
:                        'department': 'Costume & Make-Up',
:                        'gender': 0,
:                        'id': 3196524,
:                        'job': 'Makeup Artist',
:                        'known_for_department': 'Acting',
:                        'name': 'Ella Burton',
:                        'original_name': 'Ella Burton',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '635308899590e3007afb6f1a',
:                        'department': 'Art',
:                        'gender': 0,
:                        'id': 3751706,
:                        'job': 'Set Decoration',
:                        'known_for_department': 'Art',
:                        'name': 'Luca Grandi',
:                        'original_name': 'Luca Grandi',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530898a0f1a20079633e41',
:                        'department': 'Art',
:                        'gender': 0,
:                        'id': 3751707,
:                        'job': 'Set Decoration',
:                        'known_for_department': 'Art',
:                        'name': 'Kieran Shaw',
:                        'original_name': 'Kieran Shaw',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '635309e5c9dbf9007afeddf9',
:                        'department': 'Costume & Make-Up',
:                        'gender': 0,
:                        'id': 3751717,
:                        'job': 'Makeup Trainee',
:                        'known_for_department': 'Costume & Make-Up',
:                        'name': 'Cara Burton',
:                        'original_name': 'Cara Burton',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530aec56b9f7007b1348ae',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 3751722,
:                        'job': 'Additional Photography',
:                        'known_for_department': 'Camera',
:                        'name': 'Charlie Schanschieff',
:                        'original_name': 'Charlie Schanschieff',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530aff84448e007f77eee9',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 3751723,
:                        'job': 'Casting Assistant',
:                        'known_for_department': 'Production',
:                        'name': 'Rosie Dart',
:                        'original_name': 'Rosie Dart',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530b504ca676007a52e2e3',
:                        'department': 'Editing',
:                        'gender': 0,
:                        'id': 3751724,
:                        'job': 'Online Editor',
:                        'known_for_department': 'Editing',
:                        'name': 'Guilhem Coulibaly',
:                        'original_name': 'Guilhem Coulibaly',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530b8ad8e225007d98d583',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 3751725,
:                        'job': 'Location Manager',
:                        'known_for_department': 'Production',
:                        'name': 'Esther Aja',
:                        'original_name': 'Esther Aja',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530b985f4b7300835c4c78',
:                        'department': 'Art',
:                        'gender': 0,
:                        'id': 3751726,
:                        'job': 'Location Scout',
:                        'known_for_department': 'Art',
:                        'name': 'Jasmine Rose Burridge',
:                        'original_name': 'Jasmine Rose Burridge',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530ba85f4b73007b853308',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 3751727,
:                        'job': 'Assistant Location Manager',
:                        'known_for_department': 'Production',
:                        'name': 'Hannah M.G. Cole',
:                        'original_name': 'Hannah M.G. Cole',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530bb5a0f1a20090b0e629',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 3751728,
:                        'job': 'Assistant Location Manager',
:                        'known_for_department': 'Production',
:                        'name': 'Hamish Gray',
:                        'original_name': 'Hamish Gray',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c0ec99826008297eb2c',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 3751729,
:                        'job': 'Location Coordinator',
:                        'known_for_department': 'Production',
:                        'name': 'Charles G McManus-Burke',
:                        'original_name': 'Charles G McManus-Burke',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c33d8e225007d98d5ab',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 3751730,
:                        'job': 'Location Assistant',
:                        'known_for_department': 'Production',
:                        'name': 'Jacques Potgieter',
:                        'original_name': 'Jacques Potgieter',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c3fc99826008297eb3a',
:                        'department': 'Production',
:                        'gender': 0,
:                        'id': 3751731,
:                        'job': 'Location Assistant',
:                        'known_for_department': 'Production',
:                        'name': 'Zaheer Raja',
:                        'original_name': 'Zaheer Raja',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c51255dba008ab6e66c',
:                        'department': 'Art',
:                        'gender': 0,
:                        'id': 3751732,
:                        'job': 'Location Scout',
:                        'known_for_department': 'Art',
:                        'name': 'Raul Tarifa',
:                        'original_name': 'Raul Tarifa',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530c6fc9dbf9007f021883',
:                        'department': 'Sound',
:                        'gender': 0,
:                        'id': 3751733,
:                        'job': 'Musician',
:                        'known_for_department': 'Sound',
:                        'name': 'Barnaby Archer',
:                        'original_name': 'Barnaby Archer',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530cd45f4b73008d5671df',
:                        'department': 'Crew',
:                        'gender': 0,
:                        'id': 3751734,
:                        'job': 'Assistant Script',
:                        'known_for_department': 'Crew',
:                        'name': 'Rosy Barker',
:                        'original_name': 'Rosy Barker',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530d7cf3b49a007dd36c91',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 3751736,
:                        'job': 'Camera Trainee',
:                        'known_for_department': 'Camera',
:                        'name': 'Cecily Bedner',
:                        'original_name': 'Cecily Bedner',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530dfc84448e009154c213',
:                        'department': 'Lighting',
:                        'gender': 0,
:                        'id': 3751737,
:                        'job': 'Electrician',
:                        'known_for_department': 'Lighting',
:                        'name': 'Keane Farrelly',
:                        'original_name': 'Keane Farrelly',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530f18255dba008ab6e6d5',
:                        'department': 'Camera',
:                        'gender': 0,
:                        'id': 3751740,
:                        'job': 'Camera Trainee',
:                        'known_for_department': 'Camera',
:                        'name': 'Lucrezia Pollice',
:                        'original_name': 'Lucrezia Pollice',
:                        'popularity': 0.6,
:                        'profile_path': None},
:                       {'adult': False,
:                        'credit_id': '63530f27880c9200796d1efb',
:                        'department': 'Lighting',
:                        'gender': 0,
:                        'id': 3751741,
:                        'job': 'Electrician',
:                        'known_for_department': 'Lighting',
:                        'name': 'Joe Weeks',
:                        'original_name': 'Joe Weeks',
:                        'popularity': 0.6,
:                        'profile_path': None}],
:              'id': 829280},
:  'details': {'adult': False,
:              'backdrop_path': '/n2OaA7Je0fgcVnfJM7xDJoPny7x.jpg',
:              'belongs_to_collection': {'backdrop_path': '/HScQCcEd3yucY3XYRCnkRzl7Gp.jpg',
:                                        'id': 829314,
:                                        'name': 'Enola Holmes Collection',
:                                        'poster_path': '/9QfsXZTS7gDJwkSmmBPlml3P8ca.jpg'},
:              'budget': 0,
:              'genres': [{'id': 9648, 'name': 'Mystery'},
:                         {'id': 12, 'name': 'Adventure'},
:                         {'id': 35, 'name': 'Comedy'},
:                         {'id': 80, 'name': 'Crime'}],
:              'homepage': 'https://www.netflix.com/title/81406219',
:              'id': 829280,
:              'imdb_id': 'tt14641788',
:              'original_language': 'en',
:              'original_title': 'Enola Holmes 2',
:              'overview': 'Now a detective-for-hire like her infamous brother, '
:                          'Enola Holmes takes on her first official case to '
:                          'find a missing girl, as the sparks of a dangerous '
:                          'conspiracy ignite a mystery that requires the help '
:                          'of friends — and Sherlock himself — to unravel.',
:              'popularity': 368.299,
:              'poster_path': '/tegBpjM5ODoYoM1NjaiHVLEA0QM.jpg',
:              'production_companies': [{'id': 923,
:                                        'logo_path': '/5UQsZrfbfG2dYJbx8DxfoTr2Bvu.png',
:                                        'name': 'Legendary Pictures',
:                                        'origin_country': 'US'},
:                                       {'id': 121424,
:                                        'logo_path': None,
:                                        'name': 'PCMA Productions',
:                                        'origin_country': 'US'}],
:              'production_countries': [{'iso_3166_1': 'US',
:                                        'name': 'United States of America'},
:                                       {'iso_3166_1': 'GB',
:                                        'name': 'United Kingdom'}],
:              'release_date': '2022-11-30',
:              'revenue': 0,
:              'runtime': 129,
:              'spoken_languages': [{'english_name': 'German',
:                                    'iso_639_1': 'de',
:                                    'name': 'Deutsch'},
:                                   {'english_name': 'English',
:                                    'iso_639_1': 'en',
:                                    'name': 'English'},
:                                   {'english_name': 'Spanish',
:                                    'iso_639_1': 'es',
:                                    'name': 'Español'}],
:              'status': 'Released',
:              'tagline': 'Go Big. Go Holmes.',
:              'title': 'Enola Holmes 2',
:              'video': False,
:              'vote_average': 7.614,
:              'vote_count': 410},
:  'external_ids': {'facebook_id': None,
:                   'id': 829280,
:                   'imdb_id': 'tt14641788',
:                   'instagram_id': None,
:                   'twitter_id': None,
:                   'wikidata_id': None},
:  'keywords': {'id': 829280,
:               'keywords': [{'id': 703, 'name': 'detective'},
:                            {'id': 8250, 'name': 'victorian england'},
:                            {'id': 9663, 'name': 'sequel'},
:                            {'id': 160342, 'name': 'female detective'},
:                            {'id': 273879, 'name': 'sherlock holmes'}]},
:  'retrieved_dt': '2022-12-29T10:00:05.571657+00:00'}
: Task finished in 0.87s

** DB save
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    from tmdb.db import TmdbDb
    from tmdb.tmdb import TmdbManager
    from tmdb.movie import TmdbMovie

    tm = TmdbManager()
    mid = 1978
    movie = TmdbMovie.from_tmdb(mid=mid, tm=tm)
    t=TmdbDb()
    n=t.save_movie(movie)
    print(n)

runf(func)  # pylint: disable=undefined-variable
#+end_src

** DB load
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.db import TmdbDb

    t=TmdbDb()
    mid = 1975
    movie=t.load_movie(mid=mid)
    if movie:
        pprint.pprint(movie.data)
    else:
        print(movie)


runf(func)  # pylint: disable=undefined-variable
#+end_src

** Get from db or tm
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager
    from tmdb.db import TmdbDb
    from tmdb.movie import TmdbMovie

    tm = TmdbManager()
    db=TmdbDb()
    mid = 1975
    movie = TmdbMovie.from_db_or_tmdb(mid=mid,db=db,tm=tm)
    pprint.pprint(movie.data)


runf(func)  # pylint: disable=undefined-variable
#+end_src

** Persons
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager
    from tmdb.db import TmdbDb
    from tmdb.movie import TmdbMovie

    tm = TmdbManager()
    db = TmdbDb()
    mid = 1975
    movie = TmdbMovie.from_db_or_tmdb(mid=mid, db=db, tm=tm)
    pprint.pprint(movie.data['credits'])
    # pids = movie.person_ids()
    # print(len(pids))
    # print(pids)


runf(func)  # pylint: disable=undefined-variable
#+end_src

** Info
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager
    from tmdb.db import TmdbDb
    from tmdb.movie import TmdbMovie

    tm = TmdbManager()
    db=TmdbDb()
    mid = 1892
    movie = TmdbMovie.from_db_or_tmdb(mid=mid,db=db,tm=tm)
    pprint.pprint(movie.infos())


runf(func)  # pylint: disable=undefined-variable
#+end_src

#+RESULTS:
: {'cast': [{'actor': 'Mark Hamill', 'character': 'Luke Skywalker', 'pid': 2},
:           {'actor': 'Harrison Ford', 'character': 'Han Solo', 'pid': 3},
:           {'actor': 'Carrie Fisher', 'character': 'Princess Leia', 'pid': 4},
:           {'actor': 'Billy Dee Williams',
:            'character': 'Lando Calrissian',
:            'pid': 3799},
:           {'actor': 'Anthony Daniels', 'character': 'C-3PO', 'pid': 6},
:           {'actor': 'Peter Mayhew', 'character': 'Chewbacca', 'pid': 24343},
:           {'actor': 'Sebastian Shaw',
:            'character': 'Anakin Skywalker',
:            'pid': 28235},
:           {'actor': 'Ian McDiarmid', 'character': 'The Emperor', 'pid': 27762},
:           {'actor': 'Frank Oz', 'character': 'Yoda (voice)', 'pid': 7908},
:           {'actor': 'James Earl Jones',
:            'character': 'Voice of Darth Vader (voice)',
:            'pid': 15152},
:           {'actor': 'David Prowse', 'character': 'Darth Vader', 'pid': 24342},
:           {'actor': 'Alec Guinness',
:            'character': "Ben 'Obi-Wan' Kenobi",
:            'pid': 12248},
:           {'actor': 'Kenny Baker', 'character': 'R2-D2 / Paploo', 'pid': 130},
:           {'actor': 'Michael Pennington',
:            'character': 'Moff Jerjerrod',
:            'pid': 1230989},
:           {'actor': 'Kenneth Colley',
:            'character': 'Admiral Piett',
:            'pid': 10734},
:           {'actor': 'Michael Carter',
:            'character': 'Bib Fortuna',
:            'pid': 199055},
:           {'actor': 'Denis Lawson', 'character': 'Wedge', 'pid': 47698},
:           {'actor': 'Tim Rose', 'character': 'Admiral Ackbar', 'pid': 114761},
:           {'actor': 'Dermot Crowley',
:            'character': 'General Madine',
:            'pid': 17484},
:           {'actor': 'Caroline Blakiston',
:            'character': 'Mon Mothma',
:            'pid': 37442},
:           {'actor': 'Warwick Davis', 'character': 'Wicket', 'pid': 11184},
:           {'actor': 'Jeremy Bulloch', 'character': 'Boba Fett', 'pid': 33185},
:           {'actor': 'Femi Taylor', 'character': 'Oola', 'pid': 137295},
:           {'actor': 'Annie Arbogast',
:            'character': 'Sy Snootles',
:            'pid': 1430215},
:           {'actor': 'Claire Davenport',
:            'character': 'Fat Dancer',
:            'pid': 692664},
:           {'actor': 'Jack Purvis', 'character': 'Teebo', 'pid': 132538},
:           {'actor': 'Mike Edmonds', 'character': 'Logray', 'pid': 219382},
:           {'actor': 'Jane Busby', 'character': 'Chief Chirpa', 'pid': 1430217},
:           {'actor': 'Malcolm Dixon',
:            'character': 'Ewok Warrior',
:            'pid': 995639},
:           {'actor': 'Mike Cottrell',
:            'character': 'Ewok Warrior',
:            'pid': 1430487},
:           {'actor': 'Nicki Reade', 'character': 'Nicki', 'pid': 1430492},
:           {'actor': 'Adam Bareham',
:            'character': 'Jhoff, a traffic control officer on the Executor',
:            'pid': 1430494},
:           {'actor': 'Jonathan Oliver',
:            'character': 'Stardestroyer Controller #2',
:            'pid': 1430499},
:           {'actor': 'Pip Miller',
:            'character': 'Stardestroyer Captain #1',
:            'pid': 110422},
:           {'actor': 'Tom Mannion',
:            'character': 'Stardestroyer Captain #2',
:            'pid': 147482},
:           {'actor': 'Margo Apostolos',
:            'character': 'Ewok Tokkat',
:            'pid': 1430525},
:           {'actor': 'Ray Armstrong', 'character': 'Ewok', 'pid': 1430526},
:           {'actor': 'Eileen Baker', 'character': 'Ewok', 'pid': 1430527},
:           {'actor': 'Michael Henbury Ballan',
:            'character': 'Ewok',
:            'pid': 1430528},
:           {'actor': 'Bobby Bell', 'character': 'Ewok', 'pid': 81414},
:           {'actor': 'Patty Bell', 'character': 'Ewok', 'pid': 1430556},
:           {'actor': 'Alan Bennett', 'character': 'Ewok', 'pid': 1430564},
:           {'actor': 'Sarah Bennett', 'character': 'Ewok', 'pid': 1430565},
:           {'actor': 'Pamela Betts', 'character': 'Ewok', 'pid': 1430566},
:           {'actor': 'Danny Blackner', 'character': 'Ewok', 'pid': 1430567},
:           {'actor': 'Linda Bowley', 'character': 'Ewok', 'pid': 1430568},
:           {'actor': 'Peter Burroughs', 'character': 'Ewok', 'pid': 1430569},
:           {'actor': 'Debbie Lee Carrington',
:            'character': 'Romba an Ewok',
:            'pid': 19753},
:           {'actor': 'Maureen Charlton', 'character': 'Ewok', 'pid': 1430576},
:           {'actor': 'Willie Coppen', 'character': 'Ewok', 'pid': 1430580},
:           {'actor': 'Sadie Corre', 'character': 'Ewok', 'pid': 121478},
:           {'actor': 'Tony Cox',
:            'character': "Ewok Wicket's younger brother Widdle",
:            'pid': 19754},
:           {'actor': 'John Cumming', 'character': 'Ewok', 'pid': 1430588},
:           {'actor': "Jean D'Agostino", 'character': 'Ewok', 'pid': 1430590},
:           {'actor': 'Luis De Jesus', 'character': 'Ewok', 'pid': 106406},
:           {'actor': 'Debbie Dixon',
:            'character': 'Ewok Wijunkee',
:            'pid': 1430594},
:           {'actor': 'Margarita Fernández', 'character': 'Ewok', 'pid': 19756},
:           {'actor': 'Phil Fondacaro', 'character': 'Ewok', 'pid': 12662},
:           {'actor': 'Sal Fondacaro', 'character': 'Ewok', 'pid': 1430595},
:           {'actor': 'Tony Friel', 'character': 'Ewok', 'pid': 1430596},
:           {'actor': 'Daniel Frishman', 'character': 'Ewok', 'pid': 19751},
:           {'actor': 'John Ghavan', 'character': 'Ewok', 'pid': 1430610},
:           {'actor': 'Michael Gilden', 'character': 'Ewok', 'pid': 1224317},
:           {'actor': 'Paul Grant', 'character': 'Ewok', 'pid': 1430611},
:           {'actor': 'Lydia Green', 'character': 'Ewok', 'pid': 1430613},
:           {'actor': 'Lars Green', 'character': 'Ewok', 'pid': 1430615},
:           {'actor': 'Pam Grizz', 'character': 'Ewok', 'pid': 1430857},
:           {'actor': 'Andrew Herd', 'character': 'Ewok', 'pid': 1430858},
:           {'actor': 'J.J. Jackson', 'character': 'Ewok', 'pid': 1430859},
:           {'actor': 'Richard Jones', 'character': 'Ewok', 'pid': 1430860},
:           {'actor': 'Trevor Jones', 'character': 'Ewok', 'pid': 1430915},
:           {'actor': 'Glynn Jones', 'character': 'Ewok', 'pid': 1430916},
:           {'actor': 'Karen Lay', 'character': 'Ewok', 'pid': 1430917},
:           {'actor': 'John Lummiss', 'character': 'Ewok', 'pid': 1430918},
:           {'actor': 'Nancy MacLean', 'character': 'Ewok', 'pid': 1430919},
:           {'actor': 'Peter Mandell', 'character': 'Ewok', 'pid': 362851},
:           {'actor': 'Carole Morris', 'character': 'Ewok', 'pid': 1430920},
:           {'actor': 'Stacie Nichols', 'character': 'Ewok', 'pid': 1430921},
:           {'actor': 'Chris Nunn', 'character': 'Ewok', 'pid': 1430922},
:           {'actor': "Barbara O'Laughlin", 'character': 'Ewok', 'pid': 1430923},
:           {'actor': 'Brian Orenstein', 'character': 'Ewok', 'pid': 1430924},
:           {'actor': 'Harrell Parker Jr.', 'character': 'Ewok', 'pid': 1430925},
:           {'actor': 'John Pedrick', 'character': 'Ewok', 'pid': 1430926},
:           {'actor': 'April Perkins', 'character': 'Ewok', 'pid': 1430950},
:           {'actor': 'Ronnie Phillips', 'character': 'Ewok', 'pid': 1430951},
:           {'actor': 'Katie Purvis', 'character': 'Ewok', 'pid': 1430952},
:           {'actor': 'Carol Read', 'character': 'Ewok', 'pid': 1430955},
:           {'actor': 'Nicholas Read', 'character': 'Ewok', 'pid': 1430957},
:           {'actor': 'Diana Reynolds', 'character': 'Ewok', 'pid': 1430958},
:           {'actor': 'Danielle Rodgers',
:            'character': 'Ewok Graak',
:            'pid': 1430961},
:           {'actor': 'Chris Romano', 'character': 'Ewok', 'pid': 1370759},
:           {'actor': 'Dean Shackelford', 'character': 'Ewok', 'pid': 1430964},
:           {'actor': 'Kiran Shah', 'character': 'Ewok', 'pid': 5531},
:           {'actor': 'Felix Silla', 'character': 'Ewok', 'pid': 33853},
:           {'actor': 'Linda Spriggs', 'character': 'Ewok', 'pid': 1430978},
:           {'actor': 'Gerald Staddon', 'character': 'Ewok', 'pid': 1430979},
:           {'actor': 'Josephine Staddon', 'character': 'Ewok', 'pid': 1430980},
:           {'actor': 'Kevin Thompson', 'character': 'Ewok', 'pid': 53760},
:           {'actor': 'Kendra Wall', 'character': 'Ewok', 'pid': 1430983},
:           {'actor': 'Brian Wheeler', 'character': 'Ewok', 'pid': 224526},
:           {'actor': 'Butch Wilhelm', 'character': 'Ewok', 'pid': 1430984},
:           {'actor': 'Mark Dodson',
:            'character': 'Salacious B. Crumb',
:            'pid': 1473715},
:           {'actor': 'Simon J. Williamson',
:            'character': 'Max Rebo',
:            'pid': 1473716},
:           {'actor': 'Richard Bonehill',
:            'character': 'Nien Nunb',
:            'pid': 1473717},
:           {'actor': 'David Gonzales', 'character': 'Ak-rev', 'pid': 1473722},
:           {'actor': 'Peter Roy',
:            'character': 'Major Olander Brit - Rebel (uncredited)',
:            'pid': 3307},
:           {'actor': 'Erik Bauersfeld',
:            'character': 'Bib Fortuna (voice)',
:            'pid': 1729665},
:           {'actor': 'Mike Quinn', 'character': 'Nein Nunb', 'pid': 1249957},
:           {'actor': 'Bill Kipsang Rotich',
:            'character': 'Nein Numb (voice)',
:            'pid': 1729666},
:           {'actor': 'Deep Roy', 'character': 'Droopy McCool', 'pid': 1295},
:           {'actor': 'Alisa Berk', 'character': 'Amanaman', 'pid': 1729667},
:           {'actor': 'Hugh Spight',
:            'character': 'Gameorrean Guard/Elom/Mon Calamari',
:            'pid': 1729668},
:           {'actor': 'Swee Lim',
:            'character': 'Attark the Hoover',
:            'pid': 1729669},
:           {'actor': 'Richard Robinson', 'character': 'Yuzzum', 'pid': 106053},
:           {'actor': 'Gerald Home', 'character': 'Tessek', 'pid': 1250666},
:           {'actor': 'Phil Herbert', 'character': 'Hermi Odle', 'pid': 1436476},
:           {'actor': 'Tim Dry', 'character': 'Whiphid', 'pid': 1729670},
:           {'actor': 'Sean Crawford', 'character': 'Whiphid', 'pid': 1729671},
:           {'actor': 'Phil Tippett', 'character': 'Rancor', 'pid': 7727},
:           {'actor': 'Toby Philpott',
:            'character': 'Jabba the Hutt',
:            'pid': 1590529},
:           {'actor': 'David Alan Barclay',
:            'character': 'Jabba the Hutt',
:            'pid': 1329519},
:           {'actor': 'Larry Ward',
:            'character': 'Jabba the Hutt (voice)',
:            'pid': 159108},
:           {'actor': 'Jasper Jacob',
:            'character': 'Captain Yorr - Imperial Pilot of ST321',
:            'pid': 1370604},
:           {'actor': 'Peter Allen',
:            'character': "Geezum - Member of Jabba's Gang (uncredited)",
:            'pid': 1227911},
:           {'actor': 'John Altman',
:            'character': 'Rebel Pilot (uncredited)',
:            'pid': 1218998},
:           {'actor': 'Glyn Baker',
:            'character': 'Lieutenant Endicott - Imperial Officer (uncredited)',
:            'pid': 47861},
:           {'actor': 'Dickey Beer',
:            'character': 'Barada / Stormtrooper / Biker Scout (uncredited)',
:            'pid': 1495190},
:           {'actor': 'Ailsa Berk',
:            'character': "Amanaman - Jabba's Bounty Hunter (uncredited)",
:            'pid': 1781593},
:           {'actor': 'Don Bies',
:            'character': "Barquin D'an / Boba Fett (special edition) "
:                         '(uncredited)',
:            'pid': 590313},
:           {'actor': 'Paul Brooke',
:            'character': 'Malakili - Rancor Keeper (uncredited)',
:            'pid': 9142},
:           {'actor': 'Ben Burtt',
:            'character': "'Freeze' Officer in Endor Bunker / Tortured Power "
:                         'Droid (voice) (uncredited)',
:            'pid': 670},
:           {'actor': 'Maurice Bush',
:            'character': 'Dengar - The Bounty Hunter (uncredited)',
:            'pid': 1220323},
:           {'actor': 'Trevor Butterfield',
:            'character': 'Lieutenant Blount - Rebel Soldier / Trandoshan - '
:                         "Member of Jabba's Gang / Stormtrooper / Calamari "
:                         "Warrior / Giran - Malakili's Assistant (uncredited)",
:            'pid': 1729660},
:           {'actor': 'Vivienne Chandler',
:            'character': 'Female X-Wing Fighter Pilot (uncredited)',
:            'pid': 5569},
:           {'actor': 'Tony Clarkin',
:            'character': 'Storm Trooper (uncredited)',
:            'pid': 151961},
:           {'actor': 'Kenneth Coombs',
:            'character': 'Imperial Officer (uncredited)',
:            'pid': 1935711},
:           {'actor': 'Andy Cunningham',
:            'character': 'Ephant Mon (uncredited)',
:            'pid': 1232860},
:           {'actor': 'Peter Diamond',
:            'character': 'Biker Scout Pushed Off Bike (uncredited)',
:            'pid': 53587},
:           {'actor': 'Richard Driscoll',
:            'character': 'X-Wing Fighter (uncredited)',
:            'pid': 101911},
:           {'actor': 'Douglas Farrell',
:            'character': 'Ewok (uncredited)',
:            'pid': 1695655},
:           {'actor': 'Alan Flyng',
:            'character': 'Imperial Officer - Executor (uncredited)',
:            'pid': 1424954},
:           {'actor': 'Ernie Fosselius',
:            'character': 'Giran - Rancor Keeper (voice) (uncredited)',
:            'pid': 1048621},
:           {'actor': 'Stuart Fox',
:            'character': 'Death Star Trooper Jad Bean (uncredited)',
:            'pid': 105492},
:           {'actor': 'Isaac Grand',
:            'character': 'Gamorrean Guard (uncredited)',
:            'pid': 1271076},
:           {'actor': 'Gordon Hann',
:            'character': 'Captain Yutani - Rebel Soldier (uncredited)',
:            'pid': 1901493},
:           {'actor': 'Alan Harris',
:            'character': 'Stormtrooper (uncredited)',
:            'pid': 964699},
:           {'actor': 'Walter Henry',
:            'character': 'Council Member in Briefing Room (uncredited)',
:            'pid': 1406400},
:           {'actor': 'Philip Herbert',
:            'character': "Hermi Odle - Jabba's 2nd Servant (uncredited)",
:            'pid': 28480},
:           {'actor': 'Larry Holt',
:            'character': 'Taym Dren-garen / Biker Scout / Sergeant Bruckman '
:                         '(uncredited)',
:            'pid': 195981},
:           {'actor': 'William Hoyland',
:            'character': 'Imperial Commander (uncredited) (unconfirmed)',
:            'pid': 219736},
:           {'actor': 'Colin Hunt',
:            'character': 'Rancor Guard / Rebel Ranger (uncredited)',
:            'pid': 2487126},
:           {'actor': 'Monty Jordan',
:            'character': 'Weequay Skiff Guard (uncredited)',
:            'pid': 1204294},
:           {'actor': 'Michael Josephs',
:            'character': "Janus Greejatus - Emperor Palpatine's Advisor "
:                         '(uncredited)',
:            'pid': 2468967},
:           {'actor': 'Eiji Kusuhara',
:            'character': 'Lieutenant Telsij - Grey Squadron (uncredited)',
:            'pid': 207310},
:           {'actor': 'Anthony Lang',
:            'character': "Sim Aloo - Emperor Palpatine's Advisor (uncredited)",
:            'pid': 1012562},
:           {'actor': 'Arnold Lee',
:            'character': "Rayc Ryjerd - Jabba's Smuggler (uncredited)",
:            'pid': 186141},
:           {'actor': 'Julius LeFlore',
:            'character': 'Skiff Master / Yotts Orren / Stormtrooper / Biker '
:                         'Scout (uncredited)',
:            'pid': 558896},
:           {'actor': 'John Maloney',
:            'character': 'Rancor Guard (uncredited)',
:            'pid': 1393133},
:           {'actor': 'Paul Markham',
:            'character': 'Imperial Officer (uncredited)',
:            'pid': 1924773},
:           {'actor': 'Richard Marquand',
:            'character': 'Maj. Marquand - AT-ST Driver / EV-9D9 (voice) '
:                         '(uncredited)',
:            'pid': 19800},
:           {'actor': 'Hilton McRae',
:            'character': 'Arvel Crynyd (uncredited)',
:            'pid': 72705},
:           {'actor': 'Billy J. Mitchell',
:            'character': 'Keir Santage (Red Seven) (uncredited)',
:            'pid': 55911},
:           {'actor': 'Amanda Noar',
:            'character': 'Jess - Female Musician flirting with Bib Fortuna '
:                         '(uncredited)',
:            'pid': 1119361},
:           {'actor': 'Terry Sach',
:            'character': 'A-Wing Pilot (uncredited)',
:            'pid': 2160733},
:           {'actor': 'Errol Shaker',
:            'character': 'Y-Wing Pilot (uncredited)',
:            'pid': 126960},
:           {'actor': 'Paul Springer',
:            'character': 'Ree Yees (uncredited)',
:            'pid': 2216338},
:           {'actor': 'Guy Standeven',
:            'character': 'Rebel Council Member in Briefing Room (uncredited)',
:            'pid': 1708535},
:           {'actor': 'Jules Walters',
:            'character': 'Rennek (uncredited)',
:            'pid': 1800616},
:           {'actor': 'Robert Watts',
:            'character': 'Lt. Watts - AT-ST Driver (uncredited)',
:            'pid': 711},
:           {'actor': 'Paul Weston',
:            'character': 'Vedain - Sand Skiff Pilot (uncredited)',
:            'pid': 10203},
:           {'actor': 'Corey Dee Williams',
:            'character': 'Klaatu (uncredited)',
:            'pid': 2055488},
:           {'actor': 'Michael Stevens',
:            'character': 'Colonel Airen Cracken - Rebel Soldier on Millennium '
:                         'Falcon (uncredited)',
:            'pid': 112652},
:           {'actor': 'Michael McCormick', 'character': 'Rancor', 'pid': 3021273},
:           {'actor': 'David Stone',
:            'character': 'B-Wing Pilot (uncredited)',
:            'pid': 3535183},
:           {'actor': 'Pat Welsh',
:            'character': 'Boushh (voice)',
:            'pid': 3810016}],
:  'countries': ['United States of America'],
:  'crew': {'composer': [{'id': 491, 'name': 'John Williams'}],
:           'director': [{'id': 19800, 'name': 'Richard Marquand'}],
:           'writer': [{'id': 1, 'name': 'George Lucas'},
:                      {'id': 8844, 'name': 'Lawrence Kasdan'}]},
:  'genres': ['Adventure', 'Action', 'Science Fiction'],
:  'id': 1892,
:  'imdb_id': 'tt0086190',
:  'languages': ['English'],
:  'original_language': 'en',
:  'original_title': None,
:  'overview': 'Luke Skywalker leads a mission to rescue his friend Han Solo '
:              'from the clutches of Jabba the Hutt, while the Emperor seeks to '
:              'destroy the Rebellion once and for all with a second dreaded '
:              'Death Star.',
:  'runtime': 135,
:  'title': 'Return of the Jedi',
:  'year': '1983'}
: Task finished in 0.02s

* Persons
** Person
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager
    from tmdb.person import TmdbPerson

    tm = TmdbManager()
    pid = 11863
    person = TmdbPerson.from_tmdb(pid=pid, tm=tm)
    pprint.pprint(person.data)


runf(func)  # pylint: disable=undefined-variable
#+end_src

** DB save
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    from tmdb.db import TmdbDb
    from tmdb.tmdb import TmdbManager
    from tmdb.person import TmdbPerson

    tm = TmdbManager()
    pid = 11863
    person = TmdbPerson.from_tmdb(pid=pid, tm=tm)
    t=TmdbDb()
    n=t.save_person(person)
    print(n)

runf(func)  # pylint: disable=undefined-variable
#+end_src

** DB load
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.db import TmdbDb

    t=TmdbDb()
    pid = 11863
    person=t.load_person(pid=pid)
    if person:
        pprint.pprint(person.data)
    else:
        print(person)


runf(func)  # pylint: disable=undefined-variable
#+end_src
* Search movie
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager

    tm = TmdbManager()
    r=tm.search_movie(query='glass onion a knives out mystery',year=2022)
    pprint.pprint(r)


runf(func)  # pylint: disable=undefined-variable
#+end_src

* Search person
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager

    tm = TmdbManager()
    r=tm.search_person(query='tatiana maslany')
    pprint.pprint(r)


runf(func)  # pylint: disable=undefined-variable
#+end_src

* Find person by imdb id
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    import pprint
    from tmdb.tmdb import TmdbManager

    tm = TmdbManager()
    iid="0000095"
    r=tm.find_person_id_by_imdb_id(iid)
    pprint.pprint(r)


runf(func)  # pylint: disable=undefined-variable
#+end_src

* Func
#+begin_src jupyter-python :async yes
def func():
    # pylint: disable=import-outside-toplevel
    pass


runf(func)  # pylint: disable=undefined-variable
#+end_src
